In [2]:
import mysql.connector

In [3]:
# Headings <p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">str</p>

In [4]:
f = open("root.csv", "r") ; data= f.read()[3:21] ; user , ppw = data[:4] , data[5:]

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Create mydatabase DB</p>

In [5]:
mydb = mysql.connector.connect(
  host="localhost",
  user=user,
  password=ppw
)

mycursor = mydb.cursor()

#mycursor.execute("CREATE DATABASE mydatabase")

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Show a list of databases in the comp. system</p>

In [4]:
mycursor.execute("SHOW DATABASES")

for x in mycursor:
  print(x)

('companydatabase',)
('faname',)
('information_schema',)
('mydatabase',)
('mydatabase001',)
('mydatabase002',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

Headings <p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Connect to DB</p>

In [77]:
mydb = mysql.connector.connect(
  host="localhost",
  user=user,
  password=ppw,
  database="mydatabase"
)

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Create table and make table inserts</p>

In [7]:
mycursor = mydb.cursor()

In [8]:
mycursor.execute("CREATE TABLE customers (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), address VARCHAR(255))")

<p style="text-align:center">Check if the created table exists</p>
<div style="border:1px solid green"></div>

In [9]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('customers',)

<p style="text-align:center">Create primary key on an existing table</p>
<div style="border:1px solid green"></div>

In [10]:
# Alternatively one can omit a primary key when creating a table then add it later
# mycursor.execute("CREATE TABLE customers (name VARCHAR(255), address VARCHAR(255))")
# mycursor.execute("ALTER TABLE customers ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY")

<p style="text-align:center">Insert a record in the "customers" table</p>
<div style="border:1px solid green"></div>

In [11]:
sql = "INSERT INTO customers (name , address) VALUES (%s , %s)"

In [12]:
val = ("John" , "Highway 21")

In [13]:
mycursor.execute(sql, val)

In [14]:
mydb.commit()

In [15]:
print( mycursor.rowcount , "record inserted.")

1 record inserted.

<p style="text-align:center">Insert multiple rows in the "customers" table</p>
<div style="border:1px solid green"></div>

In [16]:
# sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"

In [17]:
val = [
  ('Peter', 'Lowstreet 4'),
  ('Amy', 'Apple st 652'),
  ('Hannah', 'Mountain 21'),
  ('Michael', 'Valley 345'),
  ('Sandy', 'Ocean blvd 2'),
  ('Betty', 'Green Grass 1'),
  ('Richard', 'Sky st 331'),
  ('Susan', 'One way 98'),
  ('Vicky', 'Yellow Garden 2'),
  ('Ben', 'Park Lane 38'),
  ('William', 'Central st 954'),
  ('Chuck', 'Main Road 989'),
  ('Viola', 'Sideway 1633')
]

In [18]:
mycursor.executemany(sql, val)

In [19]:
mydb.commit()

In [20]:
print(mycursor.rowcount, "was inserted.")

13 was inserted.

<p style="text-align:center">Insert one row, and return the ID</p>
<div style="border:1px solid green"></div>

In [21]:
val = ("Michelle", "Blue Village")
mycursor.execute(sql, val)

In [22]:
mydb.commit()

In [23]:
print("1 record inserted, ID:", mycursor.lastrowid)

1 record inserted, ID: 15

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Select from operations</p>

In [24]:
mycursor.execute("SELECT * FROM customers")

In [25]:
myresult = mycursor.fetchall()

In [26]:
for x in myresult:
  print(x)

(1, 'John', 'Highway 21')
(2, 'Peter', 'Lowstreet 4')
(3, 'Amy', 'Apple st 652')
(4, 'Hannah', 'Mountain 21')
(5, 'Michael', 'Valley 345')
(6, 'Sandy', 'Ocean blvd 2')
(7, 'Betty', 'Green Grass 1')
(8, 'Richard', 'Sky st 331')
(9, 'Susan', 'One way 98')
(10, 'Vicky', 'Yellow Garden 2')
(11, 'Ben', 'Park Lane 38')
(12, 'William', 'Central st 954')
(13, 'Chuck', 'Main Road 989')
(14, 'Viola', 'Sideway 1633')
(15, 'Michelle', 'Blue Village')

In [27]:
mycursor.execute("SELECT * FROM customers")
myresult = mycursor.fetchone()
print(myresult)

(1, 'John', 'Highway 21')

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Where operation</p>

In [97]:
mydb = mysql.connector.connect(
  host="localhost",
  user=user,
  password=ppw,
  database="mydatabase"
)

In [98]:
mycursor = mydb.cursor()

In [30]:
sql = "SELECT * FROM customers WHERE address ='Park Lane 38'"

In [31]:
mycursor.execute(sql)

In [32]:
myresult = mycursor.fetchall()

In [33]:
for x in myresult:
  print(x)

(11, 'Ben', 'Park Lane 38')

<p style="text-align:center">Wildcard characters</p>
<div style="border:1px solid green"></div>

In [34]:
# Select records where the address contains the word "way"
sql = "SELECT * FROM customers WHERE address LIKE '%way%'"

In [35]:
mycursor.execute(sql)

In [36]:
myresult = mycursor.fetchall()

In [37]:
for x in myresult:
  print(x)

(1, 'John', 'Highway 21')
(9, 'Susan', 'One way 98')
(14, 'Viola', 'Sideway 1633')

In [38]:
sql = "SELECT * FROM customers WHERE address = %s"
adr = ("Yellow Garden 2", )

In [39]:
mycursor.execute(sql, adr)

In [40]:
myresult = mycursor.fetchall()

In [41]:
for x in myresult:
  print(x)

(10, 'Vicky', 'Yellow Garden 2')

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Order operations</p>

<p style="text-align:center">Order by name</p>
<div style="border:1px solid green"></div>

In [42]:
sql = "SELECT * FROM customers ORDER BY name ASC" # Can also order by DESC

In [43]:
mycursor.execute(sql)

In [44]:
myresult = mycursor.fetchall()

In [45]:
for x in myresult:
  print(x)

(3, 'Amy', 'Apple st 652')
(11, 'Ben', 'Park Lane 38')
(7, 'Betty', 'Green Grass 1')
(13, 'Chuck', 'Main Road 989')
(4, 'Hannah', 'Mountain 21')
(1, 'John', 'Highway 21')
(5, 'Michael', 'Valley 345')
(15, 'Michelle', 'Blue Village')
(2, 'Peter', 'Lowstreet 4')
(8, 'Richard', 'Sky st 331')
(6, 'Sandy', 'Ocean blvd 2')
(9, 'Susan', 'One way 98')
(10, 'Vicky', 'Yellow Garden 2')
(14, 'Viola', 'Sideway 1633')
(12, 'William', 'Central st 954')

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Delete record</p>

In [46]:
sql = "DELETE FROM customers WHERE address = 'Mountain 21'"

In [47]:
mycursor.execute(sql)

In [48]:
mydb.commit()

In [49]:
print(mycursor.rowcount, "record(s) deleted")

1 record(s) deleted

In [50]:
# escape %s deletion method
sql = "DELETE FROM customers WHERE address = %s"
adr = ("Yellow Garden 2", )

mycursor.execute(sql, adr)

mydb.commit()

print(mycursor.rowcount, "record(s) deleted")

1 record(s) deleted

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Delete table</p>

In [53]:
sql = "DROP TABLE notcustomers"

<p style="text-align:center">Drop if exist (to escape the error above)</p>
<div style="border:1px solid green"></div>

In [62]:
sql = "DROP TABLE IF EXISTS notcustomers"

In [63]:
mycursor.execute(sql)

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Update table</p>

In [57]:
sql = "UPDATE customers SET address = 'Canyon 123' WHERE address = 'Valley 345'"

In [58]:
mycursor.execute(sql)

In [59]:
mydb.commit()

In [60]:
print(mycursor.rowcount, "record(s) affected")

1 record(s) affected

In [64]:
# %s placeholder value escape

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Limit operation</p>

In [65]:
mycursor.execute("SELECT * FROM customers LIMIT 5")

In [66]:
myresult = mycursor.fetchall()

In [67]:
for x in myresult:
  print(x)

(1, 'John', 'Highway 21')
(2, 'Peter', 'Lowstreet 4')
(3, 'Amy', 'Apple st 652')
(5, 'Michael', 'Canyon 123')
(6, 'Sandy', 'Ocean blvd 2')

<p style="text-align:center">Index from another position</p>
<div style="border:1px solid green"></div>

In [72]:
# Starts from position 3 and returns 5 records.
mycursor.execute("SELECT * FROM customers LIMIT 5 OFFSET 2")

In [73]:
myresult = mycursor.fetchall()

In [74]:
for x in myresult:
  print(x)

(3, 'Amy', 'Apple st 652')
(5, 'Michael', 'Canyon 123')
(6, 'Sandy', 'Ocean blvd 2')
(7, 'Betty', 'Green Grass 1')
(8, 'Richard', 'Sky st 331')

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Join operation</p>

<p style="text-align:center">Create users table</p>
<div style="border:1px solid green"></div>

In [155]:
mycursor.execute("CREATE TABLE users (id INT PRIMARY KEY, name VARCHAR(255), fav INT)")

In [154]:
mycursor.execute("DROP TABLE users")

In [156]:
sql = "INSERT INTO users (id, name, fav) VALUES (%s, %s , %s)"

In [157]:
val = [
    (1,'John', 154),
    (2,'Peter', 154),
    (3,'Amy', 155),
    (4,'Hannah', None),
    (5,'Michael', None)
]

In [158]:
mycursor.executemany(sql, val)

In [159]:
mydb.commit()

In [160]:
print(mycursor.rowcount, "was inserted.")

5 was inserted.

<p style="text-align:center">Create products table</p>
<div style="border:1px solid green"></div>

In [141]:
mycursor.execute("CREATE TABLE products (id INT PRIMARY KEY, name VARCHAR(255))")

In [140]:
mycursor.execute("DROP TABLE products")

In [143]:
sql = "INSERT INTO products (id, name) VALUES (%s, %s)"

In [144]:
val = [
    (154 , 'Chocolate Heaven'),
    (155 , 'Tasty Lemons'),
    (156 , 'Vanilla Dreams')
]

In [145]:
mycursor.executemany(sql, val)

In [146]:
mydb.commit()

In [147]:
print(mycursor.rowcount, "was inserted.")

3 was inserted.

<p style="text-align:center">Join operation</p>
<div style="border:1px solid green"></div>

In [161]:
mydb = mysql.connector.connect(
  host="localhost",
  user=user,
  password=ppw,
  database="mydatabase"
)

In [162]:
mycursor = mydb.cursor()

In [175]:
sql = "SELECT \
  users.name AS user, \
  products.name AS favorite \
  FROM users \
  INNER JOIN products ON users.fav = products.id"

In [176]:
mycursor.execute(sql)

In [177]:
myresult = mycursor.fetchall()

In [178]:
for x in myresult:
  print(x)

('John', 'Chocolate Heaven')
('Peter', 'Chocolate Heaven')
('Amy', 'Tasty Lemons')

<p style="text-align:center">Select all users and their favorite product // Left Join</p>
<div style="border:1px solid green"></div>

In [167]:
sql = "SELECT \
  users.name AS user, \
  products.name AS favorite \
  FROM users \
  LEFT JOIN products ON users.fav = products.id"

<p style="text-align:center">Select all products, and the user(s) who have them as their favorite // Right Join</p>
<div style="border:1px solid green"></div>

In [171]:
sql = "SELECT \
  users.name AS user, \
  products.name AS favorite \
  FROM users \
  RIGHT JOIN products ON users.fav = products.id"

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Main SQL Tutorial</p>

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Full DB Course</p>

In [183]:
"""
mycursor.execute("SELECT * FROM customers LIMIT 5")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)
"""

In [12]:
def create_DB(name):
    "Creates a database with database name as {name}"
    mydb = mysql.connector.connect(
    host="localhost",
    user=user,
    password=ppw,
    )
    mycursor = mydb.cursor()
    mycursor.execute(f"CREATE DATABASE {name}")

In [11]:
def change_password():
    "Changes current password of user 'root' to 'password'"
    mydb = mysql.connector.connect(
    host="localhost",
    user=user,
    password=ppw
    )
    mycursor = mydb.cursor()
    mycursor.execute(f"ALTER USER 'root'@localhost IDENTIFIED BY 'password'")

In [10]:
def print_all_DBs():
    "Changes current password of user 'root' to 'password'"
    mydb = mysql.connector.connect(
    host="localhost",
    user=user,
    password=ppw
    )
    mycursor = mydb.cursor()
    "prints out all databases available for the selected user"
    mycursor.execute("SHOW DATABASES")
    for x in mycursor:
      print(x)

In [504]:
print_all_DBs()

('companydatabase',)
('faname',)
('information_schema',)
('mydatabase',)
('mydatabase001',)
('mydatabase002',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [9]:
def show_tables(db_name):
    "Shows all tables in a DB"
    mydb = mysql.connector.connect(
    host="localhost",
    user=user,
    password=ppw,
    database=f"{db_name}"
    )
    mycursor = mydb.cursor()
    mycursor.execute("SHOW TABLES")
    for x in mycursor:
      print(x)

In [502]:
show_tables('mydatabase')

('customers',)
('products',)
('users',)

In [8]:
def describe_table(db ,table_name):
    "Describe table in a DB"
    mydb = mysql.connector.connect(
    host="localhost",
    user=user,
    password=ppw,
    database=db
    )
    mycursor = mydb.cursor()
    mycursor.execute(f"DESCRIBE {table_name}")
    for x in mycursor:
      print(x[0])

In [525]:
describe_table("mydatabase", 'customers')

id
name
address

In [15]:
def sqlTable_to_pd(db_name , table_name):
    "Get Keys"
    import numpy as np
    import pandas as pd
    
    mydb = mysql.connector.connect(
    host="localhost",
    user=user,
    password=ppw,
    database= db_name
    )
    mycursor = mydb.cursor()
    mycursor.execute(f"DESCRIBE {table_name}")
    keys = np.array([( str(key[0]) + ' '+ str(key[1]) ).replace("'", '') for key in mycursor])
    
    "Get rows"
    mycursor.execute(f"SELECT * FROM {table_name}")
    myresult = mycursor.fetchall()
    rows = np.array([list(row) for row in myresult])
    
    df = pd.DataFrame(rows , columns=keys)
    return df

In [522]:
sqlTable_to_pd('mydatabase','customers')

   id int name varchar(255) address varchar(255)
0       1              John           Highway 21
1       2             Peter          Lowstreet 4
2       3               Amy         Apple st 652
3       5           Michael           Canyon 123
4       6             Sandy         Ocean blvd 2
5       7             Betty        Green Grass 1
6       8           Richard           Sky st 331
7       9             Susan           One way 98
8      11               Ben         Park Lane 38
9      12           William       Central st 954
10     13             Chuck        Main Road 989
11     14             Viola         Sideway 1633
12     15          Michelle         Blue Village

<div style="border:1px solid green;"></div>
<div style="background:orange;">
<h1>Basic data types in sql</h1>
<ul>
    <li>INT</li>
    <li>DECIMAL(lBeforeDec,roundTo)</li>
    <li>VARCHAR(l)</li>
    <li>BLOB  (Binary Large Object : Stores large objects i.e. images)</li>
    <li>DATE (YYYY-MM-DD)</li>
    <li>TIMESTAMP (DATE HH:MM:SS)</li>
</ul>
</div>
<div style="border:1px solid green;"></div>

In [ ]:
# constraints : NOT NULL , UNIQUE, DEFAULT 'default_value', AUTO_INCREMENT

In [ ]:
create_DB("companydatabase")

In [13]:
print_all_DBs()

('companydatabase',)
('faname',)
('information_schema',)
('mydatabase',)
('mydatabase001',)
('mydatabase002',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [14]:
mydb = mysql.connector.connect(
  host="localhost",
  user=user,
  password=ppw,
  database="companydatabase"
)
mycursor = mydb.cursor()

In [516]:
# mycursor.execute("DROP TABLE employee")

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Create tables</p>

<p style="text-align:center">Creating 'employee' table</p>
<div style="border:1px solid green"></div>

In [517]:
mycursor.execute("CREATE TABLE employee(\
                emp_id INT PRIMARY KEY,\
                first_name VARCHAR(40),\
                last_name VARCHAR(40),\
                birth_day DATE,\
                sex VARCHAR(1),\
                salary INT,\
                super_id INT,\
                branch_id INT\
                )")

In [22]:
describe_table('companydatabase' , 'employee')

emp_id
first_name
last_name
birth_day
sex
salary
super_id
branch_id

<p style="text-align:center">Creating 'branch' table</p>
<div style="border:1px solid green"></div>

In [ ]:
mycursor.execute("CREATE TABLE branch(\
                branch_id INT PRIMARY KEY,\
                branch_name VARCHAR(40),\
                mgr_id INT,\
                mgr_start_date DATE,\
                FOREIGN KEY(mgr_id) REFERENCES employee(emp_id) ON DELETE SET NULL\
                )")

In [15]:
describe_table('companydatabase' , 'branch')

branch_id
branch_name
mgr_id
mgr_start_date

<p style="text-align:center">Relate tables with foreign keys table</p>
<div style="border:1px solid green"></div>

In [17]:
mycursor.execute("ALTER TABLE employee\
                ADD FOREIGN KEY(branch_id)\
                REFERENCES branch(branch_id)\
                ON DELETE SET NULL\
                ")

In [24]:
mycursor.execute("ALTER TABLE employee\
                ADD FOREIGN KEY(super_id)\
                REFERENCES employee(emp_id)\
                ON DELETE SET NULL\
                ")

<p style="text-align:center">Creating 'client' table</p>
<div style="border:1px solid green"></div>

In [30]:
mycursor.execute("CREATE TABLE client(\
                client_id INT PRIMARY KEY,\
                client_name VARCHAR(40),\
                branch_id INT,\
                FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE SET NULL\
                )")

In [72]:
describe_table('companydatabase' , 'client')

client_id
client_name
branch_id

<p style="text-align:center">Creating 'works_with' table</p>
<div style="border:1px solid green"></div>

In [39]:
mycursor.execute("CREATE TABLE works_with(\
                emp_id INT,\
                client_id INT,\
                total_sales INT,\
                PRIMARY KEY(emp_id , client_id),\
                FOREIGN KEY(emp_id) REFERENCES employee(emp_id) ON DELETE CASCADE,\
                FOREIGN KEY(client_id) REFERENCES client(client_id) ON DELETE CASCADE\
                )")

In [41]:
describe_table('companydatabase' , 'works_with')

emp_id
client_id
total_sales

<p style="text-align:center">Creating 'branch_supplier' table</p>
<div style="border:1px solid green"></div>

In [42]:
mycursor.execute("CREATE TABLE branch_supplier(\
                branch_id INT,\
                supplier_name VARCHAR(40),\
                supply_type VARCHAR(40),\
                PRIMARY KEY(branch_id , supplier_name),\
                FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE CASCADE\
                )")

In [43]:
describe_table('companydatabase' , 'branch_supplier')

branch_id
supplier_name
supply_type

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Insert into tables</p>

<p style="text-align:center">Insert values into 'employee' table</p>
<div style="border:1px solid green"></div>

In [53]:
describe_table('companydatabase' , 'employee')

emp_id
first_name
last_name
birth_day
sex
salary
super_id
branch_id

In [ ]:
sql = "INSERT INTO employee (emp_id , first_name , last_name ,\
        birth_day , sex , salary , super_id , branch_id) \
        VALUES (%s , %s , %s , %s , %s , %s , %s , %s)"

val = [
  (100, 'David', 'Wallace', '1967-11-17', 'M' , 250000 , None , None),
  (101, 'Jan',   'Levinson','1961-05-11', 'F' , 110000 , 100  , None),
  (102, 'Michael','Scott',  '1964-03-15', 'M' , 75000  , 100  , None),
  (103, 'Angela', 'Martin', '1971-06-25', 'F' , 63000  , 102  , None),
  (104, 'Kelly',  'Kapoor', '1980-02-05', 'F' , 55000  , 102  , None), 
  (105, 'Stanley','Hudson', '1958-02-19', 'M' , 69000  , 102  , None),
  (106, 'Josh',   'Porter', '1969-09-05', 'M' , 78000  , 100  , None),
  (107, 'Andy',   'Bernard','1973-07-22', 'M' , 65000  , 106  , None),
  (108, 'Jim',    'Helpert','1978-10-01', 'M' , 71000  , 106  , None)
]
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, "was inserted.")

In [63]:
sqlTable_to_pd('companydatabase','employee')

,emp_id bint,first_name bvarchar(40),last_name bvarchar(40),birth_day bdate,sex bvarchar(1),salary bint,super_id bint,branch_id bint
0,100,David,Wallace,1967-11-17,M,250000,None,None
1,101,Jan,Levinson,1961-05-11,F,110000,100,None
2,102,Michael,Scott,1964-03-15,M,75000,100,None
3,103,Angela,Martin,1971-06-25,F,63000,102,None
4,104,Kelly,Kapoor,1980-02-05,F,55000,102,None
5,105,Stanley,Hudson,1958-02-19,M,69000,102,None
6,106,Josh,Porter,1969-09-05,M,78000,100,None
7,107,Andy,Bernard,1973-07-22,M,65000,106,None
8,108,Jim,Helpert,1978-10-01,M,71000,106,None

<p style="text-align:center">Insert values into 'branch' table</p>
<div style="border:1px solid green"></div>

In [54]:
describe_table('companydatabase' , 'branch')

branch_id
branch_name
mgr_id
mgr_start_date

In [61]:
sql = "INSERT INTO branch (branch_id , branch_name ,\
        mgr_id , mgr_start_date) \
        VALUES (%s , %s , %s , %s)"

val = [
  (1,  'Corporate', 100 , '2006-02-09'),
  (2,  'Scranton' , 102 , '1992-04-06'),
  (3,  'Stamford' , 106 , '1998-02-13')
]
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, "was inserted.")

3 was inserted.

In [64]:
sqlTable_to_pd('companydatabase','branch')

  branch_id bint branch_name bvarchar(40) mgr_id bint mgr_start_date bdate
0              1                Corporate         100           2006-02-09
1              2                 Scranton         102           1992-04-06
2              3                 Stamford         106           1998-02-13

<p style="text-align:center">Update 'employee' table</p>
<div style="border:1px solid green"></div>

In [70]:
sql = "UPDATE employee \
        SET branch_id = %s \
        WHERE emp_id = %s"

val = [
    (1 , 100),
    (1 , 101),
    (2 , 102),
    (2 , 103),
    (2 , 104),
    (2 , 105),
    (3 , 106),
    (3 , 107),
    (3 , 108)
]
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, "was updated.")

0 was updated.

In [69]:
sqlTable_to_pd('companydatabase','employee')

,emp_id bint,first_name bvarchar(40),last_name bvarchar(40),birth_day bdate,sex bvarchar(1),salary bint,super_id bint,branch_id bint
0,100,David,Wallace,1967-11-17,M,250000,None,1
1,101,Jan,Levinson,1961-05-11,F,110000,100,1
2,102,Michael,Scott,1964-03-15,M,75000,100,2
3,103,Angela,Martin,1971-06-25,F,63000,102,2
4,104,Kelly,Kapoor,1980-02-05,F,55000,102,2
5,105,Stanley,Hudson,1958-02-19,M,69000,102,2
6,106,Josh,Porter,1969-09-05,M,78000,100,3
7,107,Andy,Bernard,1973-07-22,M,65000,106,3
8,108,Jim,Helpert,1978-10-01,M,71000,106,3

<p style="text-align:center">Insert values into 'client' table</p>
<div style="border:1px solid green"></div>

In [73]:
describe_table('companydatabase' , 'client')

client_id
client_name
branch_id

In [75]:
sql = "INSERT INTO client (client_id , client_name , \
        branch_id) \
        VALUES (%s , %s , %s)"

val = [
  (400,  'Dunmore Highschool' , 2),
  (401,  'Lackawana Country'  , 2),
  (402,  'FedEx'              , 3),
  (403,  'John Daly Law, LLC' , 3),
  (404,  'Scranton Whitepages', 2),
  (405,  'Times Newspaper'    , 3),
  (406,  'FedEx'              , 2)
]
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, "was inserted.")

7 was inserted.

In [76]:
sqlTable_to_pd('companydatabase','client')

  client_id bint client_name bvarchar(40) branch_id bint
0            400       Dunmore Highschool              2
1            401        Lackawana Country              2
2            402                    FedEx              3
3            403       John Daly Law, LLC              3
4            404      Scranton Whitepages              2
5            405          Times Newspaper              3
6            406                    FedEx              2

<p style="text-align:center">Insert values into 'works_with' table</p>
<div style="border:1px solid green"></div>

In [78]:
describe_table('companydatabase' , 'works_with')

emp_id
client_id
total_sales

In [79]:
sql = "INSERT INTO works_with (emp_id , client_id , \
        total_sales) \
        VALUES (%s , %s , %s)"

val = [
  (105,  400 , 55000),
  (102,  401 , 267000),
  (108,  402 , 22500),
  (107,  403 , 5000),
  (108,  403 , 12000),
  (105,  404 , 33000),
  (107,  405 , 26000),
  (102,  406 , 3),
  (105,  406 , 2)
]
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, "was inserted.")

9 was inserted.

In [80]:
sqlTable_to_pd('companydatabase', 'works_with')

   emp_id bint  client_id bint  total_sales bint
0          102             401            267000
1          102             406                 3
2          105             400             55000
3          105             404             33000
4          105             406                 2
5          107             403              5000
6          107             405             26000
7          108             402             22500
8          108             403             12000

In [81]:
sql = "UPDATE works_with \
        SET total_sales = %s \
        WHERE emp_id = %s AND client_id = %s"

val = [
    (15000  , 102 , 406),
    (130000 , 105 , 406),
]
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, "was updated.")

2 was updated.

In [88]:
sqlTable_to_pd('companydatabase', 'works_with').sort_values(by=['client_id bint'])

   emp_id bint  client_id bint  total_sales bint
2          105             400             55000
0          102             401            267000
7          108             402             22500
5          107             403              5000
8          108             403             12000
3          105             404             33000
6          107             405             26000
1          102             406             15000
4          105             406            130000

<p style="text-align:center">Insert values into 'branch_supplier' table</p>
<div style="border:1px solid green"></div>

In [83]:
describe_table('companydatabase' , 'branch_supplier')

branch_id
supplier_name
supply_type

In [ ]:
23056

In [89]:
sql = "INSERT INTO branch_supplier (branch_id , supplier_name , \
        supply_type) \
        VALUES (%s , %s , %s)"

val = [
  (2,  'Hammer Mill'         , 'Paper'),
  (2,  'Uni-ball'            , 'Writing Utensils'),
  (3,  'Patriot Paper'       , 'Paper'),
  (2,  'J.T. Forms & Labels' , 'Custom Forms'),
  (3,  'Uni-ball'            , 'Writing Utensils'),
  (3,  'Hammer Mill'         , 'Paper'),
  (3,  'Stamford Labels'     , 'Custom Forms')
] 
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, "was inserted.")

7 was inserted.

In [90]:
sqlTable_to_pd('companydatabase', 'branch_supplier')

  branch_id bint supplier_name bvarchar(40) supply_type bvarchar(40)
0              2                Hammer Mill                    Paper
1              2        J.T. Forms & Labels             Custom Forms
2              2                   Uni-ball         Writing Utensils
3              3                Hammer Mill                    Paper
4              3              Patriot Paper                    Paper
5              3            Stamford Labels             Custom Forms
6              3                   Uni-ball         Writing Utensils

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">All created tables</p>

In [91]:
sqlTable_to_pd('companydatabase', 'employee')

,emp_id bint,first_name bvarchar(40),last_name bvarchar(40),birth_day bdate,sex bvarchar(1),salary bint,super_id bint,branch_id bint
0,100,David,Wallace,1967-11-17,M,250000,None,1
1,101,Jan,Levinson,1961-05-11,F,110000,100,1
2,102,Michael,Scott,1964-03-15,M,75000,100,2
3,103,Angela,Martin,1971-06-25,F,63000,102,2
4,104,Kelly,Kapoor,1980-02-05,F,55000,102,2
5,105,Stanley,Hudson,1958-02-19,M,69000,102,2
6,106,Josh,Porter,1969-09-05,M,78000,100,3
7,107,Andy,Bernard,1973-07-22,M,65000,106,3
8,108,Jim,Helpert,1978-10-01,M,71000,106,3

In [92]:
sqlTable_to_pd('companydatabase', 'branch')

  branch_id bint branch_name bvarchar(40) mgr_id bint mgr_start_date bdate
0              1                Corporate         100           2006-02-09
1              2                 Scranton         102           1992-04-06
2              3                 Stamford         106           1998-02-13

In [93]:
sqlTable_to_pd('companydatabase', 'client')

  client_id bint client_name bvarchar(40) branch_id bint
0            400       Dunmore Highschool              2
1            401        Lackawana Country              2
2            402                    FedEx              3
3            403       John Daly Law, LLC              3
4            404      Scranton Whitepages              2
5            405          Times Newspaper              3
6            406                    FedEx              2

In [94]:
sqlTable_to_pd('companydatabase', 'works_with')

   emp_id bint  client_id bint  total_sales bint
0          102             401            267000
1          102             406             15000
2          105             400             55000
3          105             404             33000
4          105             406            130000
5          107             403              5000
6          107             405             26000
7          108             402             22500
8          108             403             12000

In [95]:
sqlTable_to_pd('companydatabase', 'branch_supplier')

  branch_id bint supplier_name bvarchar(40) supply_type bvarchar(40)
0              2                Hammer Mill                    Paper
1              2        J.T. Forms & Labels             Custom Forms
2              2                   Uni-ball         Writing Utensils
3              3                Hammer Mill                    Paper
4              3              Patriot Paper                    Paper
5              3            Stamford Labels             Custom Forms
6              3                   Uni-ball         Writing Utensils

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Sql prompts</p>

In [101]:
"Find first five employees"
sql = "SELECT * \
  FROM employee \
  ORDER BY emp_id \
  LIMIT 5"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(100, 'David', 'Wallace', datetime.date(1967, 11, 17), 'M', 250000, None, 1)
(101, 'Jan', 'Levinson', datetime.date(1961, 5, 11), 'F', 110000, 100, 1)
(102, 'Michael', 'Scott', datetime.date(1964, 3, 15), 'M', 75000, 100, 2)
(103, 'Angela', 'Martin', datetime.date(1971, 6, 25), 'F', 63000, 102, 2)
(104, 'Kelly', 'Kapoor', datetime.date(1980, 2, 5), 'F', 55000, 102, 2)

In [104]:
"Find out all different genders"
sql = "SELECT DISTINCT sex \
  FROM employee"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

('M',)
('F',)

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Sql functions</p>

In [105]:
"Find the number of employees"
sql = "SELECT COUNT(emp_id) \
  FROM employee"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(9,)

In [107]:
"Find the number of employees with supervisors"
sql = "SELECT COUNT(super_id) \
  FROM employee"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(8,)

In [112]:
"Find the numer of female employees born after 1970"
sql = "SELECT COUNT(emp_id) \
  FROM employee \
  WHERE sex  = 'F' AND birth_day > '1970-12-31'"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(2,)

In [115]:
"Find the average salary of all male employees"
sql = "SELECT AVG(salary) \
  FROM employee \
  WHERE sex = 'M'"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(Decimal('101333.3333'),)

In [116]:
"Find the salary sum of all female employees"
sql = "SELECT SUM(salary) \
  FROM employee \
  WHERE sex = 'F'"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(Decimal('228000'),)

In [120]:
"Find the number of each males and females"
sql = "SELECT COUNT(sex), sex \
  FROM employee \
  GROUP By sex"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(6, 'M')
(3, 'F')

In [121]:
"Find the total sales of each salesperson"
sql = "SELECT SUM(total_sales), emp_id \
  FROM works_with \
  GROUP By emp_id"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(Decimal('282000'), 102)
(Decimal('218000'), 105)
(Decimal('31000'), 107)
(Decimal('34500'), 108)

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Wildcards</p>

In [ ]:
" % = any number of chars , _ = 1 character"

In [128]:
"Find any client who's an LLC"
sql = "SELECT * \
  FROM client \
  WHERE client_name LIKE '%LLC'"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(403, 'John Daly Law, LLC', 3)

In [133]:
"Find all employees born in February"
sql = "SELECT first_name , birth_day \
  FROM employee \
  WHERE birth_day LIKE '____-02-%'"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

('Kelly', datetime.date(1980, 2, 5))
('Stanley', datetime.date(1958, 2, 19))

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Union</p>

In [140]:
"Return a list of all clients and branch suppliers' names with branch ids they're associated with"
sql = "SELECT client_name AS external_names , client.branch_id \
  FROM client \
  UNION \
  SELECT supplier_name , branch_supplier.branch_id \
  FROM branch_supplier \
  "
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

('Dunmore Highschool', 2)
('Lackawana Country', 2)
('FedEx', 3)
('John Daly Law, LLC', 3)
('Scranton Whitepages', 2)
('Times Newspaper', 3)
('FedEx', 2)
('Hammer Mill', 2)
('J.T. Forms & Labels', 2)
('Uni-ball', 2)
('Hammer Mill', 3)
('Patriot Paper', 3)
('Stamford Labels', 3)
('Uni-ball', 3)

In [150]:
"Return a list of all money spent or earned by the company"
sql = "SELECT salary \
  FROM employee \
  UNION \
  SELECT total_sales\
  FROM works_with \
  "
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(250000,)
(110000,)
(75000,)
(63000,)
(55000,)
(69000,)
(78000,)
(65000,)
(71000,)
(267000,)
(15000,)
(33000,)
(130000,)
(5000,)
(26000,)
(22500,)
(12000,)

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Joins</p>

In [152]:
sql = "INSERT INTO branch (branch_id , branch_name , \
        mgr_id , mgr_start_date) \
        VALUES (%s , %s , %s , %s)"

val = [
  (4,  'Buffalo', None , None ),
] 
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, "was inserted.")

1 was inserted.

In [153]:
sqlTable_to_pd('companydatabase', 'branch')

  branch_id bint branch_name bvarchar(40) mgr_id bint mgr_start_date bdate
0              1                Corporate         100           2006-02-09
1              2                 Scranton         102           1992-04-06
2              3                 Stamford         106           1998-02-13
3              4                  Buffalo        None                 None

In [160]:
"Find all branches and the names of their managers"
# inner join
sql = "SELECT employee.emp_id , employee.first_name , branch.branch_name \
  FROM employee \
  INNER JOIN branch \
  ON employee.emp_id = branch.mgr_id \
  "
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(100, 'David', 'Corporate')
(102, 'Michael', 'Scranton')
(106, 'Josh', 'Stamford')

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Nested quiries</p>

In [24]:
mydb = mysql.connector.connect(
  host="localhost",
  user=user,
  password=ppw,
  database="companydatabase"
)
mycursor = mydb.cursor()

In [9]:
"Find names of all employees with more than 30k sales to a single client"
sql = "\
  SELECT employee.first_name , employee.last_name\
  FROM employee\
  WHERE employee.emp_id IN (\
      SELECT works_with.emp_id \
      FROM works_with \
      WHERE works_with.total_sales > 30000) \
  "
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

('Michael', 'Scott')
('Stanley', 'Hudson')

In [38]:
"Find names of all employees with more than 30k sales to a single client"
sql = "SELECT client.client_name\
  FROM client\
  WHERE client.branch_id IN(\
      SELECT branch.branch_id\
      FROM branch\
      WHERE branch.mgr_id = 102)"

mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

('Dunmore Highschool',)
('Lackawana Country',)
('Scranton Whitepages',)
('FedEx',)

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">On delete</p>

In [ ]:
# ON DELETE SET NULL : i.e. deleting an employee whos a supervisor to x employees will leave these x employees with
# supervisor set to NULL

In [ ]:
# ON DELETE CASCADE : i.e. deleting an facebook user will also delete all their posts and comments instead of setting the
# post author to NULL as opposed to "ON DELETE SET NULL"

<p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Triggers</p>

In [43]:
sql = "CREATE TABLE trigger_test (\
    message VARCHAR(100)\
    )"

mycursor.execute(sql)
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('branch',)
('branch_supplier',)
('client',)
('employee',)
('trigger_test',)
('works_with',)

In [ ]:
sql = """\
CREATE \
    TRIGGER my_trigger BEFORE INSERT \
    ON employee \
    FOR EACH ROW BEGIN \
        INSERT INTO trigger_test VALUES('added new employee'); \
    END;
"""
mycursor.execute(sql)

In [12]:
mycursor.execute("SHOW TRIGGERS")
for x in mycursor:
  print(x)

('my_trigger', 'INSERT', 'employee', b"BEGIN         INSERT INTO trigger_test VALUES('added new employee');     END", 'BEFORE', datetime.datetime(2021, 1, 5, 13, 44, 2, 66), {'NO_ENGINE_SUBSTITUTION', 'STRICT_TRANS_TABLES'}, 'root@localhost', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')

In [13]:
sql = """\
INSERT INTO employee \
VALUES(109 , 'Oscar' , 'Martinez' , '1968-02-19' , 'M' , 69000 , 106 , 3)\
"""
mycursor.execute(sql)
mydb.commit()
print(mycursor.rowcount, "was inserted.")

1 was inserted.

In [16]:
sqlTable_to_pd('companydatabase', 'employee')

,emp_id bint,first_name bvarchar(40),last_name bvarchar(40),birth_day bdate,sex bvarchar(1),salary bint,super_id bint,branch_id bint
0,100,David,Wallace,1967-11-17,M,250000,None,1
1,101,Jan,Levinson,1961-05-11,F,110000,100,1
2,102,Michael,Scott,1964-03-15,M,75000,100,2
3,103,Angela,Martin,1971-06-25,F,63000,102,2
4,104,Kelly,Kapoor,1980-02-05,F,55000,102,2
5,105,Stanley,Hudson,1958-02-19,M,69000,102,2
6,106,Josh,Porter,1969-09-05,M,78000,100,3
7,107,Andy,Bernard,1973-07-22,M,65000,106,3
8,108,Jim,Helpert,1978-10-01,M,71000,106,3
9,109,Oscar,Martinez,1968-02-19,M,69000,106,3

In [17]:
sqlTable_to_pd('companydatabase', 'trigger_test')

  message bvarchar(100)
0    added new employee

In [19]:
sql = """\
CREATE \
    TRIGGER my_trigger1 BEFORE INSERT \
    ON employee \
    FOR EACH ROW BEGIN \
        INSERT INTO trigger_test VALUES(NEW.first_name); \
    END;
"""
mycursor.execute(sql)

In [25]:
mycursor.execute("SHOW TRIGGERS")
for x in mycursor:
  print(x)

('my_trigger', 'INSERT', 'employee', b"BEGIN         INSERT INTO trigger_test VALUES('added new employee');     END", 'BEFORE', datetime.datetime(2021, 1, 5, 13, 44, 2, 66), {'NO_ENGINE_SUBSTITUTION', 'STRICT_TRANS_TABLES'}, 'root@localhost', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')
('my_trigger1', 'INSERT', 'employee', b'BEGIN         INSERT INTO trigger_test VALUES(NEW.first_name);     END', 'BEFORE', datetime.datetime(2021, 1, 5, 14, 5, 1, 23), {'NO_ENGINE_SUBSTITUTION', 'STRICT_TRANS_TABLES'}, 'root@localhost', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')

In [26]:
sql = """\
INSERT INTO employee \
VALUES(110 , 'Kevin' , 'Malone' , '1978-02-19' , 'M' , 69000 , 106 , 3)\
"""
mycursor.execute(sql)
mydb.commit()
print(mycursor.rowcount, "was inserted.")

1 was inserted.

In [27]:
sqlTable_to_pd('companydatabase', 'trigger_test')

  message bvarchar(100)
0    added new employee
1    added new employee
2                 Kevin

In [28]:
sql = """\
CREATE \
    TRIGGER my_trigger2 BEFORE INSERT \
    ON employee \
    FOR EACH ROW BEGIN \
        IF NEW.sex = 'M' THEN \
            INSERT INTO trigger_test VALUES('added male employee'); \
        ELSEIF NEW.sex = 'F' THEN \
            INSERT INTO trigger_test VALUES('added female employee'); \
        ELSE \
            INSERT INTO trigger_test VALUES('added another employee'); \
        END IF; \
    END; \
"""
mycursor.execute(sql)

# Could also use AFTER DELETE trigger

In [29]:
mycursor.execute("SHOW TRIGGERS")
for x in mycursor:
  print(x)

('my_trigger', 'INSERT', 'employee', b"BEGIN         INSERT INTO trigger_test VALUES('added new employee');     END", 'BEFORE', datetime.datetime(2021, 1, 5, 13, 44, 2, 66), {'NO_ENGINE_SUBSTITUTION', 'STRICT_TRANS_TABLES'}, 'root@localhost', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')
('my_trigger1', 'INSERT', 'employee', b'BEGIN         INSERT INTO trigger_test VALUES(NEW.first_name);     END', 'BEFORE', datetime.datetime(2021, 1, 5, 14, 5, 1, 23), {'NO_ENGINE_SUBSTITUTION', 'STRICT_TRANS_TABLES'}, 'root@localhost', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')
('my_trigger2', 'INSERT', 'employee', b"BEGIN         IF NEW.sex = 'M' THEN             INSERT INTO trigger_test VALUES('added male employee');         ELSEIF NEW.sex = 'F' THEN             INSERT INTO trigger_test VALUES('added female employee');         ELSE             INSERT INTO trigger_test VALUES('added another employee');         END IF;     END", 'BEFORE', datetime.datetime(2021, 1, 5, 14, 15, 55, 18), {'NO_ENGINE_SUBSTITUTION', 'STRICT_TRANS_TABLES'}, 'root@localhost', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')

In [30]:
sql = """\
INSERT INTO employee \
VALUES(111 , 'Pam' , 'Beesly' , '1988-02-19' , 'F' , 69000 , 106 , 3)\
"""
mycursor.execute(sql)
mydb.commit()
print(mycursor.rowcount, "was inserted.")

1 was inserted.

In [31]:
sqlTable_to_pd('companydatabase', 'trigger_test')

   message bvarchar(100)
0     added new employee
1     added new employee
2                  Kevin
3     added new employee
4                    Pam
5  added female employee

 <p style="border: 1px solid green; padding: 20px; background: orange; text-align: center ">Entity Relationship (ER) Diagrams</p>

<div style="border:1px solid green;"></div>
<div style="background:grey;">
<h1>Entity</h1>
<ul>
    <li> An object that we want to model and store information about</li>
</ul>
</div>

<img src='images/entity.PNG'></img>

<div style="border:1px solid green;"></div>

<div style="border:1px solid green;"></div>
<div style="background:grey;">
<h1>Attributes</h1>
<ul>
    <li> Specific pieces of information about an entity </li>
</ul>
</div>

<img src='images/attributes.PNG'></img>

<div style="border:1px solid green;"></div>

<div style="border:1px solid green;"></div>
<div style="background:grey;">
<h1>Primary key</h1>
<ul>
    <li> Atrribute(s) that uniquely identify an entry in the database table </li>
</ul>
</div>

<img src='images/primaryKey.PNG'></img>

<div style="border:1px solid green;"></div>

<div style="border:1px solid green;"></div>
<div style="background:grey;">
<h1>Composite attribute</h1>
<ul>
    <li> An attribute that can be broken up into sub-categories </li>
</ul>
</div>

<img src='images/compositeAttributes.PNG'></img>

<div style="border:1px solid green;"></div>

<div style="border:1px solid green;"></div>
<div style="background:grey;">
<h1>Multi-valued attribute</h1>
<ul>
    <li> An attribute that can have more than one value </li>
</ul>
</div>

<img src='images/multivaluedAttributes.PNG'></img>

<div style="border:1px solid green;"></div>

<div style="border:1px solid green;"></div>
<div style="background:grey;">
<h1>Derived attribute</h1>
<ul>
    <li> An attribute that can be derived from other attributes </li>
</ul>
</div>

<img src='images/derivedAttributes.PNG'></img>

<div style="border:1px solid green;"></div>

<div style="border:1px solid green;"></div>
<div style="background:grey;">
<h1>Multiple entities</h1>
<ul>
    <li> You can define more than one entity in the diagram </li>
</ul>
</div>

<img src='images/multipleEntities.PNG'></img>

<div style="border:1px solid green;"></div>

<div style="border:1px solid green;"></div>
<div style="background:grey;">
<h1>Relationships</h1>
<ul>
    <li> Defines a relationship between two entities </li>
</ul>

<h1>Total parcitipation</h1>
<ul>
    <li> All members must parcitipate in the relationship </li>
</ul>
</div>

<img src='images/relationshipsAndParcitipation.PNG'></img>

<div style="border:1px solid green;"></div>

In [45]:
"Sigle line - partial parcitipation ;\
 Double line - total parcitipation"

'Sigle line - partial parcitipation ; Double line - total parcitipation'

<div style="border:1px solid green;"></div>
<div style="background:grey;">
<h1>Relationship attribute</h1>
<ul>
    <li> An attribute about the relationship </li>
</ul>
</div>

<img src='images/relationshipAttribute.PNG'></img>

<div style="border:1px solid green;"></div>

<div style="border:1px solid green;"></div>
<div style="background:grey;">
<h1>Relationship cardinality</h1>
<ul>
    <li> The number of instances of an entity from a relation than can be associated with the relation </li>
</ul>
</div>

<img src='images/relationshipCardinality.PNG'></img><br>

<div style="border:1px solid green;"></div>

<div style="border:1px solid green;"></div>
<div style="background:grey;">

<h1>Weak entity</h1>
<ul>
    <li> An entity that cannot be uniquely identified by its attributes alone </li>
</ul>

<h1>Identifying relationship</h1>
<ul>
    <li> A relationship that serves to uniquely identify a weak entity </li>
</ul>

</div>

<img src='images/weakEntity.PNG'></img><br>

<div style="border:1px solid green;"></div>

<div style="border:1px solid green;"></div>
<div style="background:grey;">

<h1>Designed in mindmaps with limited drawing resources</h1>
<ul>
    <li> A company diagram </li>
</ul>

</div>

<img src='images/ERDiagram.PNG'></img><br>

<div style="border:1px solid green;"></div>